{
  "common": {
    "name": "vis-hqwidgets",
    "version": "1.5.0",
    "news": {
      "1.5.0": {
        "en": "Removed vis dependency and replaced with message by installation or update if vis is not installed",
        "de": "Visabhängigkeit entfernt und durch Installation oder Aktualisierung durch Meldung ersetzt, wenn vis nicht installiert ist",
        "ru": "Удаленная зависимость vis и заменена сообщением путем установки или обновления, если vis не установлен",
        "pt": "Dependência de vis removida e substituída por mensagem por instalação ou atualização se vis não estiver instalado",
        "nl": "Verwijderd vis afhankelijkheid en vervangen door bericht door installatie of update als vis niet is geïnstalleerd",
        "fr": "Supprimé vis dépendance et remplacé par message par installation ou mise à jour si vis n'est pas installé",
        "it": "Rimosso vis dipendenza e sostituito con messaggio da installazione o aggiornamento se vis non è installato",
        "es": "Eliminado vis dependencia y reemplazado por mensaje por instalación o actualización si vis no se instala",
        "pl": "Usunięty z zależności i zastąpiony komunikatem przez instalację lub aktualizację, jeśli vis nie jest zainstalowany",
        "uk": "Видаляє в'язкість і замінено повідомлення шляхом установки або оновлення, якщо в'язкість не встановлена",
        "zh-cn": "相对于依赖性删除,如果未安装,则通过安装或更新替换为消息"
      },
      "1.4.0": {
        "en": "Behavior of the dimmer was changed. If the current value is over 5% and the user clicks on dimmer, the dimmer will be set to 0%. If the current value is less than 5%, the dimmer will be set to 100%.",
        "de": "Verhalten des Dimmers wurde geändert. Wenn der aktuelle Wert über 5% liegt und der Benutzer auf Dimmer klickt, wird der Dimmer auf 0% gesetzt. Wenn der aktuelle Wert weniger als 5% beträgt, wird der Dimmer auf 100% eingestellt.",
        "ru": "Поведение диммера было изменено. Если текущее значение превышает 5%, и пользователь нажимает на деммер, диммер будет установлен на 0%. Если текущее значение меньше чем 5%, то погружение будет установлено на 100%.",
        "pt": "O comportamento do dimmer foi mudado. Se o valor atual for superior a 5% e o usuário clicar em dimmer, o dimmer será definido para 0%. Se o valor atual for inferior a 5%, o dimmer será definido para 100%.",
        "nl": "Gedrag van de dimmer is veranderd. Als de huidige waarde meer dan 5% is en de gebruiker klikt op dimmer, zal de dimmer op 0% worden gezet. Als de huidige waarde minder dan 5% is, zal de dimmer 100% zijn.",
        "fr": "Le comportement du plongeur a été changé. Si la valeur actuelle est supérieure à 5 % et que l'utilisateur cliquera sur le plongeur, le plongeur sera réglé à 0 %. Si la valeur actuelle est inférieure à 5%, le plongeur sera réglé à 100%.",
        "it": "Il comportamento del dimmer è stato cambiato. Se il valore corrente è superiore al 5% e l'utente clicca sul dimmer, il dimmer verrà impostato al 0%. Se il valore corrente è inferiore al 5%, il dimmer sarà impostato al 100%.",
        "es": "El comportamiento del martillo fue cambiado. Si el valor actual es superior al 5% y el usuario hace clic en dimmer, el dimmer se establecerá al 0%. Si el valor actual es inferior al 5%, el dimmer se fijará al 100%.",
        "pl": "Zmienił się wygląd dimmera. Jeśli aktualna wartość wynosi ponad 5%, a użytkownik kliknie na dimmer, dany dany jest 0%. Jeśli wartość bieżąca wynosi mniej niż 5%, to czynnik osiągnie 100%.",
        "uk": "Змінювалася поведінка нумера. Якщо поточне значення перевищує 5% і користувач натискає на занурення, занурення буде встановлено на 0%. Якщо поточна вартість менше 5%, занурення буде встановлена на 100%.",
        "zh-cn": "改装了一线。 如果目前的价值超过5%,用户对一线的面纱将达到30%。 如果目前的价值低于5%,则将确定100%。."
      },
      "1.3.1": {
        "en": "Added new parameter for dimmer",
        "de": "Neue Parameter für Dimmer hinzugefügt",
        "ru": "Добавлен новый параметр для dimmer",
        "pt": "Adicionado novo parâmetro para dimmer",
        "nl": "Vertaling:",
        "fr": "Ajout du nouveau paramètre pour dimmer",
        "it": "Aggiunto nuovo parametro per dimmer",
        "es": "Nuevo parámetro añadido para dimmer",
        "pl": "Dodano nowy parametr dimmera",
        "uk": "Додано новий параметр для dimmer",
        "zh-cn": "增加一线新参数"
      },
      "1.3.0": {
        "en": "Made it compatible with ioBroker.vis v2",
        "de": "Kompatibel mit ioBroker.vis v2",
        "ru": "Совместим с ioBroker.vis v2",
        "pt": "Tornado compatível com ioBroker.vis v2",
        "nl": "Maakte het compatibel met ioBroker",
        "fr": "Il est compatible avec ioBroker.vis v2",
        "it": "L'ha reso compatibile con ioBroker.vis v2",
        "es": "Lo hizo compatible con ioBroker.vis v2",
        "pl": "Jest kompatybilny z ioBroker.vis v2",
        "zh-cn": "马约恩与奥布罗克相容。"
      },
      "1.2.0": {
        "en": "Removed deprecated method `load`",
        "de": "Veraltete Methode „load“ entfernt",
        "ru": "Удален устаревший метод load",
        "pt": "Remoção do método obsoleto `load`",
        "nl": "Verouderde methode `load` . verwijderd",
        "fr": "Suppression de la méthode obsolète `load`",
        "it": "Rimosso il deprecato metodo `load`",
        "es": "Se eliminó el método obsoleto `load`",
        "pl": "Usunięto przestarzałą metodę `load`",
        "zh-cn": "删除了不推荐使用的方法 `load`"
      },
      "1.1.9": {
        "en": "Added the valve values from 0 to 1 ",
        "de": "Ventilwerte von 0 bis 1 . hinzugefügt",
        "ru": "Добавлены значения клапана от 0 до 1",
        "pt": "Adicionados os valores da válvula de 0 a 1",
        "nl": "De klepwaarden toegevoegd van 0 tot 1",
        "fr": "Ajout des valeurs de vanne de 0 à 1",
        "it": "Aggiunti i valori della valvola da 0 a 1",
        "es": "Añadidos los valores de la válvula de 0 a 1",
        "pl": "Dodano wartości zaworu od 0 do 1",
        "zh-cn": "添加了从 0 到 1 的阀门值"
      },
      "1.1.7": {
        "en": "Corrected the after comma digits for the valve",
        "de": "Die Nachkommastellen für das Ventil wurden korrigiert",
        "ru": "Исправлены цифры после запятой для клапана.",
        "pt": "Corrigidos os dígitos posteriores da vírgula para a válvula",
        "nl": "De cijfers achter de komma voor de klep zijn gecorrigeerd",
        "fr": "Correction des chiffres après la virgule pour la vanne",
        "it": "Corrette le cifre dopo la virgola per la valvola",
        "es": "Se corrigieron los dígitos posteriores a la coma de la válvula.",
        "pl": "Poprawiono cyfry po przecinku dla zaworu",
        "zh-cn": "纠正了阀门的逗号后数字"
      }
    },
    "title": "hqwidgets style Widgets",
    "titleLang": {
      "en": "High quality Widgets",
      "de": "Hochwertige Widgets",
      "ru": "Виджеты высокого качества",
      "pt": "Widgets de alta qualidade",
      "nl": "Widgets van hoge kwaliteit",
      "fr": "Widgets de haute qualité",
      "it": "Widget di alta qualità",
      "es": "Widgets de alta calidad",
      "pl": "Widżety wysokiej jakości",
      "zh-cn": "高品质的小工具"
    },
    "desc": {
      "en": "High quality Widgets for ioBroker.vis",
      "de": "Hochwertige (High quality) Widgets für ioBroker.vis",
      "ru": "Высококачественные виджеты (High quality) для ioBroker.vis",
      "pt": "Widgets de alta qualidade para ioBroker.vis",
      "nl": "Hoge kwaliteit (High quality) Widgets voor ioBroker.vis",
      "fr": "Widgets de haute qualité (High quality) pour ioBroker.vis",
      "it": "Widget di alta qualità (High quality) per ioBroker.vis",
      "es": "Widgets de alta calidad (High quality) para ioBroker.vis",
      "pl": "Wysokiej jakości widżety (High quality) dla ioBroker.vis"
    },
    "platform": "Javascript/Node.js",
    "loglevel": "info",
    "icon": "hqwidgets.png",
    "enabled": true,
    "mode": "once",
    "extIcon": "https://raw.githubusercontent.com/ioBroker/ioBroker.vis-hqwidgets/master/admin/hqwidgets.png",
    "keywords": [
      "hqwidgets",
      "vis",
      "GUI",
      "graphical",
      "scada"
    ],
    "readme": "https://github.com/ioBroker/ioBroker.vis-hqwidgets/blob/master/README.md",
    "authors": [
      "bluefox <dogafox@gmail.com>"
    ],
    "license": "MIT",
    "onlyWWW": true,
    "singleton": true,
    "type": "visualization-widgets",
    "restartAdapters": [
      "vis"
    ],
    "noConfig": true,
    "adminUI": {
      "config": "none"
    },
    "tier": 3,
    "licenseInformation": {
      "type": "free",
      "link": "https://github.com/ioBroker/ioBroker.vis-hqwidgets/blob/master/LICENSE"
    },
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "!vis",
            "!vis-2"
          ]
        },
        "title": {
          "en": "No vis adapter found",
          "de": "Kein vis-Adapter gefunden",
          "ru": "Адаптер vis не найден",
          "pt": "Nenhum adaptador vis encontrado",
          "nl": "Geen vis-adapter gevonden",
          "fr": "Aucun adaptateur vis trouvé",
          "it": "Nessun adattatore vis trovato",
          "es": "No se encontró ningún adaptador vis",
          "pl": "Nie znaleziono adaptera vis",
          "uk": "Адаптер vis не знайдено",
          "zh-cn": "找不到vis适配器"
        },
        "text": {
          "en": "This adapter requires the vis or vis-2 adapter to be installed and running. Install it, if you want to use this widgets.",
          "de": "Dieser Adapter benötigt den vis- oder vis-2-Adapter, der installiert und ausgeführt wird. Installieren Sie es, wenn Sie diese Widgets verwenden möchten.",
          "ru": "Этот адаптер требует установки и запуска адаптера vis или vis-2. Установите его, если хотите использовать эти виджеты.",
          "pt": "Este adaptador requer que o adaptador vis ou vis-2 seja instalado e executado. Instale-o, se quiser usar esses widgets.",
          "nl": "Deze adapter vereist dat de vis- of vis-2-adapter is geïnstalleerd en wordt uitgevoerd. Installeer het als u deze widgets wilt gebruiken.",
          "fr": "Cet adaptateur nécessite que l'adaptateur vis ou vis-2 soit installé et en cours d'exécution. Installez-le si vous souhaitez utiliser ces widgets.",
          "it": "Questo adattatore richiede che l'adattatore vis o vis-2 sia installato ed in esecuzione. Installalo se vuoi utilizzare questi widget.",
          "es": "Este adaptador requiere que el adaptador vis o vis-2 esté instalado y en funcionamiento. Instálalo si quieres usar estos widgets.",
          "pl": "Ten adapter wymaga zainstalowania i uruchomienia adaptera vis lub vis-2. Zainstaluj go, jeśli chcesz używać tych widżetów.",
          "uk": "Цей адаптер потребує встановлення та запуску адаптера vis або vis-2. Встановіть його, якщо хочете використовувати ці віджети.",
          "zh-cn": "此适配器需要安装和运行vis或vis-2适配器。如果要使用这些小部件，请安装它。"
        },
        "level": "info",
        "buttons": [
          "ok",
          "cancel"
        ]
      }
    ]
  },
  "native": {},
  "instanceObjects": []
}
